### 다중 리더 복제

리더 기반 복제의 단점
- 리더가 하나만 존재하기에 모든 쓰기 요청이 리더를 거친다
- 클라이언트와 리더의 네트워크 통신이 단절되면 데이터베이스에 쓰기 작업을 할 수 없다

-> 필연적으로 리더를 여러대 두는 전략을 선택해야 한다.

단일 데이터 센터 내 다중 리더를 두는 것은 그 복잡도에 비해 효율이 좋지 않다

- 단일 리더 설정 : 하나의 데이터 센터에 리더가 있기에 모든 쓰기 요청이 해당 데이터센터로 유입되야 한다.
- 다중 리더 설정 : 하나의 데이터센터 내에서는 단일 리더 설정을 하고 데이터 센터간에는 하나의 리더가 다른 리더에게 변경 사항 복제한다

MySQL의 텅스텐 리플리케이터가 있다.

다중 리더 설정의 장점 :
- 성능
- 데이터센터 중단 내성 : 각 데이터센터가 독립적으로 동작한다.
- 네트워크 문제 내성 : 비동기 복제를 사용하면 일시적 네트워크 중단에도 쓰기 처리는 진행됨

다중 리더 설정의 단점 : 하나의 데이터를 두개의 데이터센터에서 같이 변경할 수 있다. 쓰기 충돌 해소시켜줘야 함

